; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	infrared4 - mode
	thermograph5 - mode
	infrared1 - mode
	image2 - mode
	infrared3 - mode
	thermograph0 - mode
	GroundStation0 - direction
	Star7 - direction
	GroundStation3 - direction
	Star2 - direction
	Star6 - direction
	GroundStation4 - direction
	Star1 - direction
	Star8 - direction
	GroundStation5 - direction
	Planet9 - direction
	Star10 - direction
	Star11 - direction
	Planet12 - direction
	Planet13 - direction
	Planet14 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 infrared3)
	(supports instrument0 thermograph5)
	(calibration_target instrument0 Star7)
	(supports instrument1 thermograph0)
	(supports instrument1 thermograph5)
	(supports instrument1 infrared4)
	(supports instrument1 image2)
	(calibration_target instrument1 Star8)
	(calibration_target instrument1 GroundStation3)
	(calibration_target instrument1 GroundStation4)
	(supports instrument2 thermograph0)
	(supports instrument2 thermograph5)
	(supports instrument2 infrared3)
	(calibration_target instrument2 Star2)
	(calibration_target instrument2 Star8)
	(calibration_target instrument2 GroundStation5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet12)
	(supports instrument3 thermograph0)
	(supports instrument3 infrared3)
	(calibration_target instrument3 GroundStation3)
	(calibration_target instrument3 Star8)
	(calibration_target instrument3 GroundStation5)
	(supports instrument4 infrared3)
	(calibration_target instrument4 GroundStation3)
	(calibration_target instrument4 Star2)
	(calibration_target instrument4 Star7)
	(supports instrument5 thermograph0)
	(calibration_target instrument5 Star2)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star7)
	(supports instrument6 infrared3)
	(supports instrument6 infrared4)
	(calibration_target instrument6 GroundStation4)
	(calibration_target instrument6 Star6)
	(supports instrument7 thermograph5)
	(supports instrument7 infrared4)
	(calibration_target instrument7 Star1)
	(supports instrument8 infrared3)
	(supports instrument8 thermograph5)
	(supports instrument8 infrared1)
	(calibration_target instrument8 GroundStation5)
	(calibration_target instrument8 Star8)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(on_board instrument8 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star1)
)
(:goal (and
	(have_image Planet9 infrared4)
	(have_image Star10 infrared1)
	(have_image Star10 image2)
	(have_image Star11 thermograph5)
	(have_image Star11 infrared3)
	(have_image Planet12 thermograph0)
	(have_image Planet13 thermograph5)
	(have_image Planet13 image2)
	(have_image Planet14 thermograph5)
))

)

; plan
1. (turn_to satellite2 groundstation5 star1)
   deleted: (pointing satellite2 star1)
   added: (pointing satellite2 groundstation5)
   goals met: 0 of 9
2. (switch_on instrument8 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument8)
   goals met: 0 of 9
3. (calibrate satellite2 instrument8 groundstation5)
   added: (calibrated instrument8)
   goals met: 0 of 9
4. (turn_to satellite2 star10 groundstation5)
   deleted: (pointing satellite2 groundstation5)
   added: (pointing satellite2 star10)
   goals met: 0 of 9
5. (take_image satellite2 star10 instrument8 infrared1)
   added: (have_image star10 infrared1)
   goals met: 1 of 9
6. (turn_to satellite2 planet14 star10)
   deleted: (pointing satellite2 star10)
   added: (pointing satellite2 planet14)
   goals met: 1 of 9
7. (take_image satellite2 planet14 instrument8 thermograph5)
   added: (have_image planet14 thermograph5)
   goals met: 2 of 9
8. (turn_to satellite2 star11 planet14)
   deleted: (pointing satellite2 planet14)
   added: (pointing satellite2 star11)
   goals met: 2 of 9
9. (turn_to satellite0 groundstation3 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 groundstation3)
   goals met: 2 of 9
10. (take_image satellite2 star11 instrument8 infrared3)
   added: (have_image star11 infrared3)
   goals met: 3 of 9
11. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 3 of 9
12. (calibrate satellite0 instrument1 groundstation3)
   added: (calibrated instrument1)
   goals met: 3 of 9
13. (take_image satellite2 star11 instrument8 thermograph5)
   added: (have_image star11 thermograph5)
   goals met: 4 of 9
14. (turn_to satellite0 planet12 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 planet12)
   goals met: 4 of 9
15. (take_image satellite0 planet12 instrument1 thermograph0)
   added: (have_image planet12 thermograph0)
   goals met: 5 of 9
16. (turn_to satellite0 planet13 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet13)
   goals met: 5 of 9
17. (take_image satellite0 planet13 instrument1 image2)
   added: (have_image planet13 image2)
   goals met: 6 of 9
18. (take_image satellite0 planet13 instrument1 thermograph5)
   added: (have_image planet13 thermograph5)
   goals met: 7 of 9
19. (turn_to satellite0 planet9 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 planet9)
   goals met: 7 of 9
20. (take_image satellite0 planet9 instrument1 infrared4)
   added: (have_image planet9 infrared4)
   goals met: 8 of 9
21. (turn_to satellite0 star10 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star10)
   goals met: 8 of 9
22. (take_image satellite0 star10 instrument1 image2)
   added: (have_image star10 image2)
   goals met: 9 of 9
